--- a/course.md
+++ b/course.md
@@ -537,13 +588,21 @@ See 'git help git' for an overview of the system.
+## Introduction to Git: Command Overview
 
 ```text @plantUML
 @startuml
-
+Workspace -> Index: git add <file> …
+Index -> Repository: git commit -m "message"
+Workspace <- Repository: git checkout <branch>
+Repository -> "Remote Repository": git push
+Repository <- "Remote Repository": git fetch
+Workspace <- Repository: git merge <commit>
+Workspace <- "Remote Repository": git pull
 @enduml
 ```
+
+* For further information refer to the Git Documentation Reference: [git add](https://git-scm.com/docs/git-add), [git commit](https://git-scm.com/docs/git-commit), [git checkout](https://git-scm.com/docs/git-checkout), [git push](https://git-scm.com/docs/git-push), [git fetch](https://git-scm.com/docs/git-fetch), [git checkout](https://git-scm.com/docs/git-checkout), [git merge](https://git-scm.com/docs/git-merge), [git pull](https://git-scm.com/docs/git-pull)
@@ -1408,184 +1467,3 @@ If you want to go on learning about Git, try to have a look here:
-
-An overview on which level the different commands operate.
-
-```text @mermaid
-sequenceDiagram
-    Working Directory->>Staging Area: git add
-    Staging Area->>Local Repository: git commit
-    Local Repository-->>Remote Repository: git push
-    Remote Repository-->>Local Repository: git fetch
-    Local Repository->>Working Directory: git checkout
-    Local Repository->>Working Directory: git merge
-    Remote Repository-->>Working Directory: git pull
-    Working Directory->Staging Area: git diff
-    Working Directory->Local Repository: git diff HEAD
-```
-
-********************************************************************************
-
